app/Controllers/Mitra.php

SELECT *
FROM `userinfo`
WHERE `email` = 'bernaldo.n70@gmail.com'
---
    public function __construct()
    {
        $this->db = db_connect();
        $this->users = $this->db->table('users');
        $this->userinfo = $this->db->table('userinfo');

        $this->email = service('authentication')->user()->email;
        $this->user = $this->userinfo->where('email', $this->email)->get()->getRowArray();

SELECT `userinfo`.*, `users`.`created_at`
FROM `userinfo`
LEFT JOIN `users` ON `userinfo`.`email` = `users`.`email`
---
    public function index()
    {
        // $data['title'] = 'Regsosek 2022';
        // $data['mitras'] = $this->userinfo->get()->getResultArray();
        $data['mitras'] = $this->userinfo->select('userinfo.*, users.created_at, users.id')
            ->join('users', 'userinfo.email = users.email', 'left')->get()->getResultArray();