app/Controllers/Regsosek2022.php

    public function __construct()
    {
        $this->db = db_connect();
        $this->users = $this->db->table('users');
        $this->userinfo = $this->db->table('userinfo');

        $this->email = service('authentication')->user()->email;
        $this->user = $this->userinfo->where('email', $this->email)->get()->getRowArray();
---
SELECT *
FROM `userinfo`
WHERE `email` = 'bernaldo.n70@gmail.com'

    public function arusdokumenedit($kodewilayah)
    {
        if ($this->request->getPost() == null) {
            $data['arusdokumen'] = $this->sls->select('sls.*, arusdk.diterima_ipds, arusdk.diterima_mitra, arusdk.mitra, arusdk.kembali_tu, arusdk.ket')
                ->join('regsosek2022_arusdokumen as arusdk', 'sls.k_wil = arusdk.k_wil', 'left')
                ->where('sls.k_wil', $kodewilayah)
                ->get()->getRowArray();

            $data['mitras'] = $this->userinfo->select('email, nama')
                ->where('regsosek2022', 1)->get()->getResultArray();

            // dd($data);

            return view('templates/header')
                . view('templates/sidebar', $this->user)
                . view('templates/topbar')
                . view('regsosek2022/arusdokumenedit', $data);
        } else {
            if ($this->arusdokumen->where('k_wil', $kodewilayah)->get()->getResult() == null) {
                $this->arusdokumen->insert([
                    'k_wil' => $kodewilayah,
                    'ket' => strtoupper($this->request->getPost('ket')),
                    'diterima_ipds' => $this->request->getPost('diterima_ipds'),
                    'diterima_mitra' => $this->request->getPost('diterima_mitra'),
                    'mitra' => strtoupper($this->request->getPost('mitra')),
                    'kembali_tu' => $this->request->getPost('kembali_tu'),
                ]);
            } else {
                $this->arusdokumen->set([
                    'ket' => strtoupper($this->request->getPost('ket')),
                    'diterima_ipds' => $this->request->getPost('diterima_ipds'),
                    'diterima_mitra' => $this->request->getPost('diterima_mitra'),
                    'mitra' => strtoupper($this->request->getPost('mitra')),
                    'kembali_tu' => $this->request->getPost('kembali_tu'),
                ])->where('k_wil', $kodewilayah)->update();
---
SELECT `email`, `nama`
FROM `userinfo`
WHERE `regsosek2022` = 1
SELECT *
FROM `regsosek2022_arusdokumen` as `ad`
WHERE `k_wil` = '1206030004000100'
UPDATE `regsosek2022_arusdokumen` as `ad` SET `ket` = '', `diterima_ipds` = '2023-01-11', `diterima_mitra` = '2023-01-14', `mitra` = 'DUTINOVITA SIAHAAN', `kembali_tu` = '0000-00-00'
WHERE `k_wil` = '1206030004000100'
SELECT *
FROM `regsosek2022_arusdokumen` as `ad`
JOIN `regsosek2022_dokumenerror` as `e` ON `ad`.`k_wil` = `e`.`k_wil`
WHERE `ad`.`k_wil` = '1206050024000100'