app/Controllers/Regsosek2022.php

SELECT *
FROM `regsosek2022_arusdokumen` as `ad`
WHERE `k_wil` LIKE '%1206030%' ESCAPE '!'
---
    public function arusdokumenedit($kodewilayah)
    {
        if ($this->request->getPost() == null) {
            $data['arusdokumen'] = $this->sls->select('sls.*, arusdk.diterima_ipds, arusdk.diterima_mitra, arusdk.mitra, arusdk.kembali_tu, arusdk.ket')
                ->join('regsosek2022_arusdokumen as arusdk', 'sls.k_wil = arusdk.k_wil', 'left')
                ->where('sls.k_wil', $kodewilayah)
                ->get()->getRowArray();

            // dd($data);

            return view('templates/header')
                . view('templates/sidebar')
                . view('templates/topbar')
                . view('regsosek2022/arusdokumenedit', $data);
        } else {
            if ($this->arusdokumen->where('k_wil', $kodewilayah)->get()->getResult() == null) {